In [1]:
import pandas as pd

In [11]:
customers = pd.read_csv("~/Desktop/Github_content/Module_5/Data/03_Library SystemCustomers.csv")
customers

   Customer ID     Customer Name
0          1.0          Jane Doe
1          2.0        John Smith
2          3.0        Dan Reeves
3          NaN               NaN
4          5.0    William Holden
5          6.0     Jaztyn Forest
6          7.0     Jackie Irving
7          8.0  Matthew Stirling
8          9.0         Emory Ted

In [12]:
# Delete empty rows
customers.dropna(inplace=True)
customers

   Customer ID     Customer Name
0          1.0          Jane Doe
1          2.0        John Smith
2          3.0        Dan Reeves
4          5.0    William Holden
5          6.0     Jaztyn Forest
6          7.0     Jackie Irving
7          8.0  Matthew Stirling
8          9.0         Emory Ted

In [ ]:
# Change Customer ID to INT 
customers['Customer ID'] = customers['Customer ID'].astype('Int32')
customers

   Customer ID     Customer Name
0            1          Jane Doe
1            2        John Smith
2            3        Dan Reeves
4            5    William Holden
5            6     Jaztyn Forest
6            7     Jackie Irving
7            8  Matthew Stirling
8            9         Emory Ted

In [44]:
book = pd.read_csv("~/Desktop/Github_content/Module_5/Data/03_Library Systembook.csv")
book.head()

,Id,Books,Book checkout,Book Returned,Days allowed to borrow,Customer ID
0,1.0,Catcher in the Rye,"""20/02/2023""",25/02/2023,2 weeks,1.0
1,2.0,Lord of the rings the two towers,"""24/03/2023""",21/03/2023,2 weeks,2.0
2,3.0,Lord of the rings the return of the kind,"""29/03/2023""",25/03/2023,2 weeks,3.0
3,4.0,The hobbit,"""02/04/2023""",25/03/2023,2 weeks,4.0
4,5.0,Dune,"""02/04/2023""",25/03/2023,2 weeks,5.0

In [45]:
book.describe()

              Id  Customer ID
count  21.000000    20.000000
mean   11.000000     4.150000
std     6.204837     2.814904
min     1.000000     1.000000
25%     6.000000     2.000000
50%    11.000000     3.000000
75%    16.000000     6.250000
max    21.000000    10.000000

In [46]:
book.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 114 entries, 0 to 113
Data columns (total 6 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Id                      21 non-null     float64
 1   Books                   20 non-null     object
 2   Book checkout           21 non-null     object
 3   Book Returned           21 non-null     object
 4   Days allowed to borrow  21 non-null     object
 5   Customer ID             20 non-null     float64
dtypes: float64(2), object(4)
memory usage: 5.5+ KB

In [47]:
book.dropna(how='any', inplace=True)
book

,Id,Books,Book checkout,Book Returned,Days allowed to borrow,Customer ID
0,1.0,Catcher in the Rye,"""20/02/2023""",25/02/2023,2 weeks,1.0
1,2.0,Lord of the rings the two towers,"""24/03/2023""",21/03/2023,2 weeks,2.0
2,3.0,Lord of the rings the return of the kind,"""29/03/2023""",25/03/2023,2 weeks,3.0
3,4.0,The hobbit,"""02/04/2023""",25/03/2023,2 weeks,4.0
4,5.0,Dune,"""02/04/2023""",25/03/2023,2 weeks,5.0
5,6.0,Little Women,"""02/04/2023""",01/05/2023,2 weeks,1.0
6,7.0,IT,"""10/04/2063""",03/04/2023,2 weeks,6.0
7,8.0,Misery,"""15/04/2023""",03/04/2023,2 weeks,7.0
8,9.0,Catch 22,"""15/04/2023""",16/04/2023,2 weeks,7.0
9,10.0,Animal Farm,"""20/04/2023""",24/04/2023,2 weeks,2.0
10,11.0,1984,"""23/04/2023""",27/04/2023,2 weeks,8.0
11,12.0,Little Women,"""02/04/2023""",01/05/2023,2 weeks,1.0
12,13.0,East of Eden,"""30/04/2023""",05/05/2023,2 weeks,2.0
13,14.0,America Is in the Heart,"""01/05/2023""",07/05/2023,2 weeks,3.0
14,15.0,Wuthering Heights,"""01/05/2023""",10/05/2023,2 weeks,9.0
15,16.0,Dark Tales,"""15/05/2023""",01/06/2023,2 weeks,2.0
16,17.0,The Bloody Chamber,"""32/05/2023""",04/06/2023,2 weeks,3.0
17,18.0,Les Miserables,"""03/06/2023""",07/06/2023,2 weeks,5.0
18,19.0,Dracula,"""10/06/2023""",10/07/2023,2 weeks,10.0
19,20.0,Frankenstein,"""01/06/2023""",20/06/2023,2 weeks,2.0

In [48]:
# Change IDs to int
book['Customer ID'] = book['Customer ID'].astype('Int32')
book['Id'] = book['Id'].astype('Int32')
book.head()

,Id,Books,Book checkout,Book Returned,Days allowed to borrow,Customer ID
0,1,Catcher in the Rye,"""20/02/2023""",25/02/2023,2 weeks,1
1,2,Lord of the rings the two towers,"""24/03/2023""",21/03/2023,2 weeks,2
2,3,Lord of the rings the return of the kind,"""29/03/2023""",25/03/2023,2 weeks,3
3,4,The hobbit,"""02/04/2023""",25/03/2023,2 weeks,4
4,5,Dune,"""02/04/2023""",25/03/2023,2 weeks,5

In [43]:
# remove quotation marks from 'Book checkout' to enable date functionality
book['Book checkout'] = book['Book checkout'].map(lambda x: x.strip('"'))
book['Book checkout'] = pd.to_datetime(book['Book checkout'], dayfirst=True)
book.head()

SyntaxError: invalid syntax (311616808.py, line 3)

In [42]:
book['Book Returned'] = pd.to_datetime(book['Book Returned'], dayfirst=True)
book.head()

,Id,Books,Book checkout,Book Returned,Days allowed to borrow,Customer ID
0,1,Catcher in the Rye,20/02/2023,2023-02-25,2 weeks,1
1,2,Lord of the rings the two towers,24/03/2023,2023-03-21,2 weeks,2
2,3,Lord of the rings the return of the kind,29/03/2023,2023-03-25,2 weeks,3
3,4,The hobbit,02/04/2023,2023-03-25,2 weeks,4
4,5,Dune,02/04/2023,2023-03-25,2 weeks,5